app/controllers/event_skills_controller.rb

  def index

    tag_records = Event.tag_counts_on(:skills).where(["#{ActsAsTaggableOn::Tag.table_name}.name LIKE ?", "#{params[:q]}%"])
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN events ON events.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Event' AND taggings.context = 'skills') AND (taggings.taggable_id IN(SELECT events.id FROM "events" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id WHERE (tags.name LIKE 'bl%')